In [1]:
import pandas as pd

# Series

In [2]:
data = [1,2,3,4,5]

In [4]:
#crear series con una list convergention
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
index = ['Linea ' + str(i) for i in range(5)]
index

['Linea 0', 'Linea 1', 'Linea 2', 'Linea 3', 'Linea 4']

In [7]:
s = pd.Series(data = data, index = index)
s

Linea 0    1
Linea 1    2
Linea 2    3
Linea 3    4
Linea 4    5
dtype: int64

In [8]:
#crear series con un objeto diccionario
data = {'Linea' + str(i): i+1 for i in range(5)}

In [9]:
s = pd.Series(data)
s

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
dtype: int64

In [10]:
s1 = s + 2
s1

Linea0    3
Linea1    4
Linea2    5
Linea3    6
Linea4    7
dtype: int64

In [11]:
#sumar 2 series con el mismo indice
s2 = s1 + s
s2

Linea0     4
Linea1     6
Linea2     8
Linea3    10
Linea4    12
dtype: int64

# Trabajar con un dataframe

In [13]:
data = [[1,2,3], [4,5,6], [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [15]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
index = ['Linea ' + str(i) for i in range(3)]
index

['Linea 0', 'Linea 1', 'Linea 2']

In [19]:
df1 = pd.DataFrame(data, index = index)
df1

         0  1  2
Linea 0  1  2  3
Linea 1  4  5  6
Linea 2  7  8  9

In [20]:
colums = ['Columna ' + str(i) for i in range(3)]
colums

['Columna 0', 'Columna 1', 'Columna 2']

In [21]:
df1 = pd.DataFrame(data, index = index, columns = colums)
df1

         Columna 0  Columna 1  Columna 2
Linea 0          1          2          3
Linea 1          4          5          6
Linea 2          7          8          9

In [22]:
data = {'Columna 0': {'Linea 0': 1, 'Linea 1': 4, 'Linea 2': 7},
        'Columna 1': {'Linea 0': 2, 'Linea 1': 5, 'Linea 2': 8},
        'Columna 2': {'Linea 0': 3, 'Linea 1': 6, 'Linea 2': 9}}
data

{'Columna 0': {'Linea 0': 1, 'Linea 1': 4, 'Linea 2': 7},
 'Columna 1': {'Linea 0': 2, 'Linea 1': 5, 'Linea 2': 8},
 'Columna 2': {'Linea 0': 3, 'Linea 1': 6, 'Linea 2': 9}}

In [24]:
df2 = pd.DataFrame(data)
df2

         Columna 0  Columna 1  Columna 2
Linea 0          1          2          3
Linea 1          4          5          6
Linea 2          7          8          9

In [25]:
data2 = [(1,2,3), (4,5,6), (7,8,9)]
data2

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [26]:
df3 = pd.DataFrame(data2, index = index, columns = colums)
df3

         Columna 0  Columna 1  Columna 2
Linea 0          1          2          3
Linea 1          4          5          6
Linea 2          7          8          9

In [27]:
df1[df1 > 0] = 'A'
df1

C:\Users\paezf\AppData\Local\Temp\ipykernel_23060\306497466.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'A' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df1[df1 > 0] = 'A'

        Columna 0 Columna 1 Columna 2
Linea 0         A         A         A
Linea 1         A         A         A
Linea 2         A         A         A

In [30]:
df2[df2 > 0] = 'B'
df2

C:\Users\paezf\AppData\Local\Temp\ipykernel_23060\416000018.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'B' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df2[df2 > 0] = 'B'

        Columna 0 Columna 1 Columna 2
Linea 0         B         B         B
Linea 1         B         B         B
Linea 2         B         B         B

In [31]:
df3[df3 > 0] = 'C'
df3

C:\Users\paezf\AppData\Local\Temp\ipykernel_23060\2590307496.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'C' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df3[df3 > 0] = 'C'

        Columna 0 Columna 1 Columna 2
Linea 0         C         C         C
Linea 1         C         C         C
Linea 2         C         C         C

In [32]:
df4 = pd.concat([df1, df2, df3])
df4

        Columna 0 Columna 1 Columna 2
Linea 0         A         A         A
Linea 1         A         A         A
Linea 2         A         A         A
Linea 0         B         B         B
Linea 1         B         B         B
Linea 2         B         B         B
Linea 0         C         C         C
Linea 1         C         C         C
Linea 2         C         C         C

In [33]:
df5 = pd.concat([df1, df2, df3], axis= 1)
df5

,Columna 0,Columna 1,Columna 2,Columna 0,Columna 1,Columna 2,Columna 0,Columna 1,Columna 2
Linea 0,A,A,A,B,B,B,C,C,C
Linea 1,A,A,A,B,B,B,C,C,C
Linea 2,A,A,A,B,B,B,C,C,C